ci4W3dev/app/Controllers/todoController.php

    public function task_edit()
    {
        $todoobject= new todo_Model();
        $id=$this->request->getpost('sid');
        //$complete=$this->request->getpost('complete');

        $data = [
           'task' => $this->request->getPost('sname'),
           //'complete'=>$complete,
           'time' => time()
        ];



        $result = $todoobject->update($id, $data);
---
UPDATE `todo` SET `task` = 'pani puri fcffnhjbjhfnkdsvhgn', `time` = 1689338869
WHERE `todo`.`id` IN ('37')

    public function updateTask()
    {

        $id = $this->request->getPost('id');
        $status = $this->request->getPost('status');


        $todoobject= new todo_Model();
        $result = $todoobject->update($id, ['complete' => $status]);
---
UPDATE `todo` SET `complete` = '1'
WHERE `todo`.`id` IN ('37')

    public function delete()
    {
        $id = $this->request->getPost('id');
        $todoModel = new todo_Model();
        $result = $todoModel->delete($id);
---
DELETE FROM `todo`
WHERE `id` IN ('87')